# Rebar Crank Overridable Parameters Get Crank Start Angled Length Formula Params Method

Source: https://www.revitapidocs.com/2026/0e99e2cd-4ed9-d304-84e3-d6ca4928b413.htm

---

| Rebar Crank Overridable Parameters Get Crank Start Angled Length Formula Params Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetCrankStartAngledLengthFormulaParams()
```

```
Public Function GetCrankStartAngledLengthFormulaParams As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetCrankStartAngledLengthFormulaParams()
```

```
member GetCrankStartAngledLengthFormulaParams : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
Returns the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters. See Also

#### Reference

RebarCrankOverridableParameters Class Autodesk.Revit.DB.Structure Namespace